Autodesk.Revit.Creation.Document.NewDuct(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Mechanical.DuctType)
Adds a new duct into the document,
using two connectors and duct type.
connector1:  The first connector to be connected to the duct.
connector2:  The second connector to be connected to the duct.
ductType:  The type of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain, or direction
does not match the direction of the duct to be created, the position of the input connectors
will govern the endpoints of the duct, but no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewDuct(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Mechanical.DuctType)
Adds a new duct into the document,
using a point, connector and duct type.
point:  The first point of the duct.
connector:  The connector to be connected to the duct.
ductType:  The type of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument point or connector is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector if necessary. If the connector's type, domain, or direction
does not match the direction of the duct to be created, the position of the input connector
will govern the endpoints of the duct, but no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewDuct(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Mechanical.DuctType)
Adds a new duct into the document.
Adds a new duct into the document,
using two points and duct type.
point1:  The first point of the duct.
point2:  The second point of the duct.
ductType:  The type of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument point1 or point2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new duct is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFoundationWall(Autodesk.Revit.DB.WallFoundationType,Autodesk.Revit.DB.Wall)
Creates a new wall foundation object.
wallFoundationType: The WallFoundation type.
wall: The Wall to append a WallFoundation.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the wall foundation type does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the wall does not exist in the given document.